/* 3. Создайте объект на основе ваших данных. 
Имя, фамилия, почта, работа, должность, возраст, страна, город, статус отношений и так далее. 
Чем больше - тем лучше (но не увлекайтесь, до 10 максимум). 
Подберите правильное название для переменной.*/
const user = {
  firstName: "Rustam",
  lastName: "Nigmati",
  email: "nigmatir@gmail.com",
  job: "NurTech",
  position: "Junior Frontend Developer",
  age: 47,
  country: "Russia",
  city: "Bugulma",
  relationshipStatus: "Married",
  children: 3
};

console.log(user);

/* 4. Создайте объект, который будет хранить данные об автомобиле (марка, модель, год выпуска, цвет, вид коробки). 
Добавьте дополнительное свойство - владелец авто, значением которого будет ОБЪЕКТ, описанный в пункте №3. 
Желательно добавлять отдельной строкой (имеется ввиду не при создании объекта) */

let car = {
  brand: "Scoda",
  model: "Octavia",
  year: 2018,
  color: "Chocolate",
  transmission: "Mechanical"
};

car.owner = user;

console.log(car);

/* 5. Написать функцию которая аргументом будет принимать объект, описанный в пункте №4. 
Она проверяет, есть ли в объекте свойство "максимальная скорость", если нет - добавляет его и задает значение, 
если есть - прекращает выполнение (ничего не делает) */

function checkMaxSpeed(object) {
  if (!object.hasOwnProperty("maxSpeed")) {
    object.maxSpeed = 196;
  }
}

checkMaxSpeed(car);

// Дополнил ф-цию по результатам созвона от 22.07.

function checkMinMaxSpeed(object) {
  if (!object.hasOwnProperty("minSpeed")) {
    object.minSpeed = 0;
  };
  if (!object.hasOwnProperty("maxSpeed")) {
    object.maxSpeed = 196;
  }
}

checkMinMaxSpeed(car);

/* 6. Написать функцию, которая получает первым аргументом — объект, а вторым аргументом — свойство объекта, 
которое нужно вывести и выводит его значение.*/

function printProperty(object, key) {
  console.log(object[key])
}

printProperty(car, 'model'); // Пример 1
printProperty(user, 'firstName'); // Пример 2

/* 7. Создать массив, который содержит названия продуктов (просто строки). */

let productsNames = [
  "Мясо", "Творог", "Мед", "Сыр", "Лаваш", "Чай", "Рис", "Гречка", "Баранки"
];

console.log(productsNames);

/* 8. Создать массив, состоящий из объектов, где объект представляет собой книгу 
(название, автор, год выпуска, цвет обложки, жанр) (3-5 книг). 
После, используя известный нам метод массив, добавить еще одну книгу в конец списка. 
Можете заменить книги на фильмы, или другую сущность, идею вы поняли.*/

let islamBooks = [
  {
    nameBook: "Сахих", author: "Абу Абдуллах Мухаммад ибн Исмаил аль-Бухари", year: 232, genre: "Сборник хадисов"
  },
  {
    nameBook: "Сахих", author: "Муслим ибн аль-Хаджжадж", year: 250, genre: "Сборник хадисов"
  },
  {
    nameBook: "Книга единобожия", author: "Мухаммад ибн Абдуль-Ваххаб", year: 1140, genre: "Акыда (Вероубеждение)"
  },
  {
    nameBook: "Три основы", author: "Мухаммад ибн Абдуль-Ваххаб", year: 1150, genre: "Акыда (Вероубеждение)"
  }
];

islamBooks.push(
  {
    nameBook: "Фаваид (Книга полезных наставлений)", author: "Ибн Каййим аль-Джаузия", year: 751, genre: "Адаб (Этика)"
  }
);

console.log(islamBooks);

/* 9. Создать еще один массив, состоящих из тех же книг, но относящийся к определенной вселенной (Гарри Поттер, Марвел и так далее). 
(Если используете другую, свою сущность - импровизируйте). 
С помощью известного нам метода массива или оператора (рекомендую использовать оператор), объединить эти два массива в один.*/

let booksAbdulWahhab = [
  {
    nameBook: "Книга единобожия", author: "Мухаммад ибн Абдуль-Ваххаб", year: 1140, genre: "Акыда (Вероубеждение)"
  },
  {
    nameBook: "Три основы", author: "Мухаммад ибн Абдуль-Ваххаб", year: 1150, genre: "Акыда (Вероубеждение)"
  }
];

let allBooks = [...islamBooks, ...booksAbdulWahhab];

console.log(allBooks);

/* 10. Почитать про метод массива — map. Написать функцию, которая принимает массив сущностей с задания №9. 
Добавляем новое свойство для объекта "isRare (это редкий)" и в зависимости от года выпуска книги 
(или какой-то логики, связанной с вашей сущностью), устанавливаем true или false. 
Что я хочу этим сказать: если книга выпущена позже 2000 года, устанавливаем true (да, это редкий), нет - false (значит это не редкий).*/

const addIsRareProperty = books => books.map(book => ({
  ...book,
  isRare: book.year <= 250
}));

const updatedBooks = addIsRareProperty(allBooks);

console.log(updatedBooks);