/* 3. Создать функцию, которая принимает 2 параметра: город и температуру 
и выводит сообщение в консоль "Сейчас в X температура — Y градусов по Цельсию" */

function printWeather(city, temperature) {
  console.log(`Сейчас в ${city} температура — ${temperature} градусов по Цельсию`);
}

printWeather("X","Y");

/*4. Создать переменную, которая хранит внутри себя скорость света (гуглим). 
Создать функцию, которая принимает 1 аргумент - скорость, внутри функции происходит проверка: 
если переданная скорость выше скорости света — выводим лог "Сверхсветовая скорость", 
если ниже — "Субсветовая скорость"? если равна — "Скорость света"*/

const SPEED_OF_LIGHT = 299792458; // скорость света в м/с

function checkSpeed(speed) {
  if (speed > SPEED_OF_LIGHT) {
    console.log(`${speed} м/с - это Сверхсветовая скорость`);
  } else if (speed < SPEED_OF_LIGHT) {
    console.log(`${speed} м/с - это Субсветовая скорость`);
  } else {
    console.log(`${speed} м/с - это Скорость света`);
  }
}

checkSpeed(500000000); // пример 1
checkSpeed(1); // пример 2
checkSpeed(299792458); // пример 3

/* 5. Создать переменную №1, которая содержит продукт и переменную №2, которая содержит его цену (на ваше усмотрение). 
Далее создаем функцию, которая принимает 1 параметр - текущий бюджет, внутри функции происходит проверка: 
если бюджет превышает цену товара - выводим лог "(ваше название товара) приобретён. Спасибо за покупку!", 
если нет - обсчитываем разницу и выводим лог "Вам не хватает X$, пополните баланс". 
То-есть с помощью функции мы пытаемся приобрести товар.*/

const productName = "Яблоки"; // название товара
const productPrice = 99.99; // цена товара в рублях

function checkBudget(cash) {
  if (cash > productPrice) {
    console.log(`Товар "${productName}" приобретён. Благодарим за покупку!`);
  } else {
    const difference = productPrice - cash;
    console.log(`Вам не хватает ${difference.toFixed(2)} рублей, пополните баланс`);
  }
}

checkBudget(150); // пример 1
checkBudget(50); // пример 2

/* 6. Создать 1 функцию и именовать её по своему усмотрению*/

function checkCentury(year) {
  const century = Math.ceil(year / 100);
  console.log(`Ваш год рождения ${year} значит вы родились в ${century} веке`);
}

checkCentury(1978); // пример 1
checkCentury(2003); // пример 2

/* 7. Создать 3 переменных (без разницы каких) и именовать их по своему усмотрению*/

const myFirstName = "Рустем";
const myLastName = "Нигмати";
const SECONDS_IN_A_MINUTE = 60;

console.log(`Меня зовут ${myFirstName} ${myLastName}. Я знаю, что в 1 минуте ${SECONDS_IN_A_MINUTE} секунд.`);