/* 2. Создаем файл js, где будет хранится массив объектов, которые представляют собой продуктовые карточки из вёрстки 
(имейте ввиду, UI-данные не относятся к данным продукта. Гуглите). 
Вам нужно описать полностью объект и продублировать его для всех карточек 
и после импортировать в homework-10 для дальнейшей работы с ним. */

export const products = [
  {
    id: 1,
    src: "images/product-1.jpg",
    alt: "Бутылочка коричневого цвета с широкой горловиной и пробкой, белой наклейкой, где надписано Диаманте",
    description: "ДЛЯ НОРМАЛЬНОЙ КОЖИ",
    name: "Увлажняющий мусс",
    text: "Глубоко увлажняет кожу лица, оставляя её мягкой и гладкой.",
    composition1: "активные натуральные комплексы",
    composition2: "витамины С, А, РР, В И Е",
    composition3: "солнцезащитные компоненты",
    price: "2 750 ₽"
  },
  {
    id: 2,
    src: "images/product-2.jpg",
    alt: "Баночка коричневого цвета с закручивающейся металлической крышкой и белой наклейкой, где надписано Диаманте",
    description: "ДЛЯ НОРМАЛЬНОЙ КОЖИ",
    name: "Увлажняющая маска",
    text: "Способствует удерживанию влаги в верхних слоях кожи.",
    composition1: "воски",
    composition2: "минералы",
    composition3: "масла",
    price: "3 500 ₽"
  },
  {
    id: 3,
    src: "images/product-3.jpg",
    alt: "Бутылочка коричневого цвета с узким горлышком и пробкой, белой наклейкой, где надписано Диаманте",
    description: "ДЛЯ НОРМАЛЬНОЙ КОЖИ",
    name: "Гель для умывания",
    text: "Интенсивно очищает, не повреждает защитный барьер кожи.",
    composition1: "минералы",
    composition2: "витамины С, А, РР, В И Е",
    composition3: "солнцезащитные компоненты",
    price: "1 650 ₽"
  },
  {
    id: 4,
    src: "images/product-4.jpg",
    alt: "Две баночки коричневого цвета (большая и маленькая) с закручивающейся металлической крышкой и белой наклейкой, где надписано Диаманте",
    description: "ДЛЯ НОРМАЛЬНОЙ КОЖИ",
    name: "Подарочный набор №1",
    text: "Набор, состоящий из увлажняющего крема и маски.",
    composition1: "воски",
    composition2: "минералы",
    composition3: "масла",
    price: "4 750 ₽"
  },
  {
    id: 5,
    src: "images/product-5.jpg",
    alt: "Набор из четырех предметов: две баночки (большая и маленькая) и две бутылочки коричневого цвета с белой наклейкой, где надписано Диаманте",
    description: "ДЛЯ НОРМАЛЬНОЙ КОЖИ",
    name: "Подарочный набор №5",
    text: "Весь набор средств Invisible symphony, крем, маска, мусс и гель для умывания.",
    composition1: "воски",
    composition2: "минералы",
    composition3: "масла",
    price: "7 520 ₽"
  }
];